/**************************************************************************************************
  Filename:       app_ble_list.h
  Revised:        $Date: 2015-05-2 $
  Revision:       $Revision: 1.0 $

**************************************************************************************************/

#ifndef APP_BLE_LIST_H
#define APP_BLE_LIST_H

/*********************************************************************
 * INCLUDES
 */
#include "app_ble.h" 
  
/*********************************************************************
 * CONSTANTS
 */

/*********************************************************************
 * MACROS
 */

/*********************************************************************
 * TYPEDEFS
 */
typedef UART_MSG Item;         //定义数据项类型
typedef struct node *PNode;    //定义节点指针

//节点的定义
typedef struct node
{
	Item item;                //数据域
	PNode next;               //链域
	
}Node,*SList;
  
/*********************************************************************
 * GLOBAL VARIABLES
 */

/*********************************************************************
 * LOCAL VARIABLES
 */
  
/*********************************************************************
 * EXTERNAL VARIABLES
 */

/*********************************************************************
 * EXTERNAL FUNCTIONS
 */

/*********************************************************************
 * FUNCTIONS
 */
extern bool SL_Creat(SList *p_list);
extern bool SL_Insert(SList list,Item item);
extern bool SL_GetItem(SList list,Item *p_item);
extern bool SL_Delete(SList list);
extern bool SL_Empty(SList list);

/*********************************************************************
*********************************************************************/

#endif /* APP_BLE_LIST_H */
